counhopig/inkwash-firmware/rust-firmware/sdkconfig.defaults
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# CONFIG_ESPTOOLPY_OCT_FLASH is not set

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="${CMAKE_CURRENT_SOURCE_DIR}/../../../../../../partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="${CMAKE_CURRENT_SOURCE_DIR}/../../../../../../partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# ESP32-S3 USB Serial/JTAG is unresponsive in automatic light sleep and may
# not re-enumerate after wake. Keep it awake only while a real USB host is
# sending SOF packets; battery/charger-only operation remains unaffected.
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Power management: automatic light sleep whenever both cores are idle
# past the threshold. IDLE_TIME_BEFORE_SLEEP is in ticks: 200 ms at
# FREERTOS_HZ=1000. The Home main loop drops to a 1 s idle cadence
# (src/main.rs), so each idle sleep exceeds the threshold and spends
# ~0.8 s of every second in real light sleep. Keys and the RTC alarm
# line wake it (src/power.rs `configure_light_sleep`). Note the plan's
# `CONFIG_FREERTOS_IDLE_TIME_BEFORE_ENTERING_LIGHT_SLEEP` is the pre-5.x
# name; IDF 5.5 calls it `CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP`.
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=200
CONFIG_NVS_ENABLED=y
CONFIG_ADC_ONESHOT_ENABLED=y
CONFIG_I2C=y
CONFIG_I2C_ENABLE_DEBUG_LOG=n
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_1=y

# Task watchdog: catch a genuine hang (stuck peripheral, a future infinite
# loop) and reboot instead of leaving the device stuck. The longest
# un-feedable window used to be the HTTPS round-trip in sync.rs running on
# the main task (handshake ~4.7s + 5s HTTP_TIMEOUT, ~10s worst case - two
# live TWDT aborts died in that window, hence the old 20s). The power
# plan's P3 moved the whole sync path onto its own subscribed task, and P2
# moved EPD refreshes off the main loop too; the main task's blocking
# windows are now short I2C/NVS ops, so 10s still gives 2x+ headroom over
# any real stall while catching a genuinely stuck loop sooner. See
# src/watchdog.rs.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

# BLE/NimBLE configuration for Phase 5 (on-demand BLE control channel).
# NimBLE is only started when the user enters the Pairing screen; it's
# torn down on exit to reclaim the ~150KB RAM it consumes. The separate
# Bluetooth controller hardware is shared between BLE and Wi-Fi; only one
# can run at a time (Bluetooth SoC limitation), but this device never
# actively uses both simultaneously (Wi-Fi is only for provisioning or
# sync during a menu operation; BLE pairing screen is reachable from Home,
# disconnecting from any Wi-Fi session).
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=5120
# The device is a GATT peripheral only; omit central/observer/scanning code
# and BLE 5 extended feature pools that the control service never uses.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=n
CONFIG_BT_NIMBLE_DTM_MODE_TEST=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
# The ESP32-S3 controller has separate build-time pools from NimBLE's host
# roles. Keep only one advertising activity plus one connection, and omit
# controller scan/DTM code. Controller code in flash also returns >20 KiB of
# scarce internal instruction RAM to the heap needed by the BLE pools.
CONFIG_BT_CTRL_BLE_MAX_ACT=2
CONFIG_BT_CTRL_BLE_SCAN=n
CONFIG_BT_CTRL_DTM_ENABLE=n
CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY=y
